*Environment - `gh-actions-prod`
Last action - `closed`
Status - terraform plan: `success`
Status - terraform apply: `success`*

<details><summary>Plan output</summary>

```
terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sf-terraform-actions/gh-actions-prod/runs/run-aa8yz6uod8Qnh4xY

Waiting for the plan to start...

Terraform v1.9.3
on linux_amd64
Initializing plugins and modules...
╷
│ Warning: Argument is deprecated
│
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on main.tf line 19, in provider "snowflake":
│   19: provider "snowflake" {
│
│ Specify the region as part of the account parameter
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_database.demo_db will be created
  + resource "snowflake_database" "demo_db" {
      + catalog                                       = (known after apply)
      + comment                                       = "Database for Snowflake Terraform demo"
      + data_retention_time_in_days                   = (known after apply)
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "DB_DB"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

<details><summary>Apply output</summary>

```
terraform
Running apply in HCP Terraform. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sf-terraform-actions/gh-actions-prod/runs/run-iH6KCGnck8rYHMvt

Waiting for the plan to start...

Terraform v1.9.3
on linux_amd64
Initializing plugins and modules...
╷
│ Warning: Argument is deprecated
│
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on main.tf line 19, in provider "snowflake":
│   19: provider "snowflake" {
│
│ Specify the region as part of the account parameter
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_database.demo_db will be created
  + resource "snowflake_database" "demo_db" {
      + catalog                                       = (known after apply)
      + comment                                       = "Database for Snowflake Terraform demo"
      + data_retention_time_in_days                   = (known after apply)
      + default_ddl_collation                         = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + id                                            = (known after apply)
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "DB_DB"
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

snowflake_database.demo_db: Creating...
snowflake_database.demo_db: Creation complete after 1s [id=DB_DB]
╷
│ Warning: Argument is deprecated
│
│   with provider["registry.terraform.io/snowflake-labs/snowflake"],
│   on main.tf line 19, in provider "snowflake":
│   19: provider "snowflake" {
│
│ Specify the region as part of the account parameter
╵

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.


```

</details>